[{"Title": "Eyes shut", "Date": "08 June, 2022", "Location": "(Your Lodgings)", "Content": "You open your eyes wide, letting the uncanny light seep into your retinas. Then you shut them, hard, ignoring the stinging of saltwater. You feel yourself moving, being thrown about, blindly, through the Is-Not: The stinging cold as you are dragged out of the water; the false relief of the Skin of the Sun's glow on your skin; foliage brushing against your battered body.\nYou remain in the dark until you are sure that Parabola has expelled you from itself. Scent, hearing, and touch tell you that you are in your lodgings; Parabolan experience tells you you are on the near side of the mirror. All that remains is to fumble about for a mirrorcatch box, before you can open your eyes."}, {"Title": "Precocious", "Date": "10 October, 2019", "Location": "(Symphysis Point)", "Content": "\"Take your time, why don't you?\" The child is going so far as to tap his foot. \"I've a game of chess to get back to. I should win in three moves.\"\nHe beckons you down an alley between two dormitory buildings."}, {"Title": "Peace with honour!", "Date": "08 October, 2019", "Location": "(Your Lodgings)", "Content": "The rat-chief struggles in your grasp. You ask a ransom of his followers – they refuse! The cheap brutes! But they're cowed into leaving.\nIn obvious indignation, the rat-chief vows to repay the favour by saving your life. You find it very hard to take this seriously. And you resolve to watch him carefully at night. But he could be useful...\nWhile sweeping away the remnants of the rats' fortifications, you come across a fold of grubby paper. A map? Or a piece of one.\n[Your lodgings are now free of rats. You may return to Watchmaker's Hill.]"}, {"Title": "Sworn", "Date": "08 October, 2019", "Location": "(Your Lodgings)", "Content": "This one was hiding in your pillow with an ether-soaked napkin and an ear-drill. Fortunately, you are in the habit of distressing your pillow thoroughly with a poker before sleep, in case of ambushes just like this one. Good to see the habit finally pay off.\nThe rat dies with a blood-curdling curse. You note the cruel patterns cut into its fur, and its armoured coat wrought from strung human fingernails."}, {"Title": "A Bad Case of Rattus Faber", "Date": "08 October, 2019", "Location": "(Your Lodgings)", "Content": "You have rats: and some of the ratholes have been dynamited open, not gnawed. An infestation of L.B.s, aka Rattus Faber! Viciously intelligent rats who set traps for humans! No landlord or Constable will tangle with these.\n[Reduce Troubled by Vermin to zero to expel the rats. The options on this storylet may change as you play them.]"}]